dejmekz/irrigation-system/ESP32/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <PubSubClient.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <RTClib.h>
#include <esp32fota.h>
#include "config.h"
#include <esp_task_wdt.h>
#include <esp_ota_ops.h>
#include <Update.h>
#include <esp_system.h>

// Why the last OTA failed, kept across the reboot that follows it.
// esp32FOTA throws this away: every partial write is reported as "Premature end
// of stream" whether the socket actually broke (UPDATE_ERROR_STREAM 6) or a
// flash erase/write failed (UPDATE_ERROR_ERASE 2 / UPDATE_ERROR_WRITE 1), which
// are very different faults with very different fixes. NOINIT rather than
// RTC_DATA so a software reset preserves it; the magic distinguishes real data
// from the garbage a cold boot leaves behind.
#define OTA_RTC_MAGIC 0x07A0FA11UL
RTC_NOINIT_ATTR static uint32_t otaMagic;
RTC_NOINIT_ATTR static int otaLastError;
RTC_NOINIT_ATTR static int otaFailCount;

// Plain-text version marker embedded in the image. FIRMWARE_VERSION is
// otherwise compiled into instructions and heartbeat arguments, so nothing can
// read it back out of a built binary — which is why the Pi's upload endpoint
// had to keep a counter of its own, and why that counter drifted from the
// version actually flashed. The Pi now scans the uploaded image for this.
#define _FW_STR(x) #x
#define FW_STR(x) _FW_STR(x)
// __attribute__((used)) alone is not enough — this toolchain's GCC predates the
// `retain` attribute, so --gc-sections still drops the string. setup() prints
// it, which both keeps it in the image and puts the running version on the
// serial console for anyone who does connect a cable.
extern "C" const char FW_VERSION_TAG[] =
    "IRRIGATION_FW_VERSION=" FW_STR(FIRMWARE_VERSION) ":END";

// ---- PCF8574A state ----
// Each bit = one relay output. Active-LOW: 0 = relay ON, 1 = relay OFF.
static uint8_t pcfState[2] = {0xFF, 0xFF};
static const uint8_t PCF_ADDR[2] = {PCF_ADDR_0, PCF_ADDR_1};

// Set when every write attempt to an expander failed. pcfState still holds the
// desired bits, so loop() re-flushes until the bus recovers: a failed OFF can
// mean a valve is still energised, which must never be quietly forgotten.
static bool pcfDirty[2] = {false, false};
#define PCF_WRITE_ATTEMPTS 3

// Defined further down with the MQTT code; the relay helpers below need them.
void publishState(int box, int valve, bool on);
void syncValvesFromShadow(int idx);

// ---- Valve / pump state (for LCD) ----
static bool valveOn[NUM_BOXES][VALVES_PER_BOX] = {};
static bool pumpOn = false;

// millis() of the OFF->ON transition of each valve, for the VALVE_MAX_ON_MS
// safety cap. Only meaningful while the matching valveOn[][] is true.
static unsigned long valveOnAt[NUM_BOXES][VALVES_PER_BOX] = {};

// Set when the VALVE_MAX_ON_MS cap closed a valve. A latched valve refuses to
// reopen until an explicit OFF (or stop_all, or a reboot) clears it — otherwise
// the Pi's keepalive re-publish would resurrect it every few minutes and the cap
// would just cycle forever instead of stopping the water.
static bool valveLatched[NUM_BOXES][VALVES_PER_BOX] = {};

// ---- Hardware health ----
static bool rtcOk = false;
static bool pcfOk[2] = {false, false};
static bool lcdOk = false;
static bool hwStatusDirty = false;

// ---- PCF fault overlay ----
// Held as start + duration rather than an absolute deadline: comparing
// millis() against a stored deadline breaks across the ~49 day rollover, so on
// a controller that runs for months the fault line would either stick on
// screen or stop appearing. Unsigned (now - start) stays correct through it.
static char pcfErrMsg[LCD_COLS + 1] = "";
static unsigned long pcfErrAt = 0;
static unsigned long pcfErrMs = 0;

static inline void pcfErrFor(unsigned long ms)
{
    pcfErrAt = millis();
    pcfErrMs = ms;
}

static inline bool pcfErrActive()
{
    return pcfErrMs && (millis() - pcfErrAt) < pcfErrMs;
}

// ---- LCD dirty flag ----
static bool lcdDirty = true;

// ---- Pump safety watchdog ----
static unsigned long lastValveActivityAt = 0;

// ---- Objects ----
WiFiClient wifiClient;
PubSubClient mqtt(wifiClient);
LiquidCrystal_I2C lcd(LCD_ADDR, LCD_COLS, LCD_ROWS);
RTC_DS3231 rtc;
esp32FOTA fota(FIRMWARE_TYPE, FIRMWARE_VERSION);

// =============================================================
// PCF8574A
// =============================================================

bool pcfFlush(int idx)
{
    Wire.beginTransmission(PCF_ADDR[idx]);
    Wire.write(pcfState[idx]);
    bool ok = (Wire.endTransmission() == 0);
    if (ok != pcfOk[idx])
    {
        pcfOk[idx] = ok;
        hwStatusDirty = true;
    }
    if (!ok)
        log_e("PCF[%d] I2C error", idx);
    return ok;
}

// Flush with immediate retries, then hand off to the loop() retry if the bus is
// still refusing. pcfState keeps the desired bits either way.
bool pcfWrite(int idx)
{
    for (int attempt = 0; attempt < PCF_WRITE_ATTEMPTS; attempt++)
        if (pcfFlush(idx))
        {
            pcfDirty[idx] = false;
            return true;
        }
    pcfDirty[idx] = true;
    return false;
}

// Decode the shadow register back into a logical "valve open" flag.
bool relayBitOn(int idx, int bit)
{
#if RELAY_ACTIVE_LOW
    return (pcfState[idx] & (1 << bit)) == 0;
#else
    return (pcfState[idx] & (1 << bit)) != 0;
#endif
}

// box 1-4, valve 1-3 — returns false if the change did not reach the hardware.
bool setRelay(int box, int valve, bool on)
{
    int idx = (box <= 2) ? 0 : 1;
    int offset = ((box - 1) % 2) * 3; // 0 for box 1/3, 3 for box 2/4
    int bit = offset + (valve - 1);

#if RELAY_ACTIVE_LOW
    if (on)
        pcfState[idx] &= ~(1 << bit);
    else
        pcfState[idx] |= (1 << bit);
#else
    if (on)
        pcfState[idx] |= (1 << bit);
    else
        pcfState[idx] &= ~(1 << bit);
#endif

    if (!pcfWrite(idx))
    {
        snprintf(pcfErrMsg, sizeof(pcfErrMsg), "PCF[%d] relay error!", idx);
        pcfErrFor(3000);
        return false;
    }
    return true;
}

// Turn all outputs off — called before any blocking reconnect
void allOff()
{
#if RELAY_ACTIVE_LOW
    pcfState[0] = pcfState[1] = 0xFF;
    digitalWrite(PUMP_PIN, HIGH);
#else
    pcfState[0] = pcfState[1] = 0x00;
    digitalWrite(PUMP_PIN, LOW);
#endif
    bool ok0 = pcfWrite(0);
    bool ok1 = pcfWrite(1);
    if (!ok0 || !ok1)
    {
        snprintf(pcfErrMsg, sizeof(pcfErrMsg), " allOff I2C error!  ");
        pcfErrFor(5000);
        log_e("allOff: PCF I2C write failed — relays may still be active!");
    }
    // Only mark closed what the bus actually accepted. An expander that refused
    // the write keeps reporting its valves open until the loop() retry lands,
    // rather than claiming everything is off while relays are still energised.
    if (ok0) syncValvesFromShadow(0);
    if (ok1) syncValvesFromShadow(1);
    memset(valveLatched, 0, sizeof(valveLatched));
    pumpOn = false;
    lcdDirty = true;
}

// =============================================================
// LCD helpers
// =============================================================

void lcdLine(int row, const char *text)
{
    if (!lcdOk) return;
    char buf[LCD_COLS + 1];
    snprintf(buf, sizeof(buf), "%-*s", LCD_COLS, text);
    lcd.setCursor(0, row);
    lcd.print(buf);
}

bool anyValveOpen()
{
    for (int b = 0; b < NUM_BOXES; b++)
        for (int v = 0; v < VALVES_PER_BOX; v++)
            if (valveOn[b][v])
                return true;
    return false;
}

bool anyActive()
{
    return pumpOn || anyValveOpen();
}

// Active view — one row per box:
// "B1:  V1  V2  V3  Pm"
//  0123456789012345678901234
void lcdShowActive()
{
    if (!lcdOk) return;
    for (int b = 0; b < NUM_BOXES; b++)
    {
        char line[LCD_COLS + 1] = "                    ";
        line[0] = 'B';
        line[1] = '1' + b;
        line[2] = ':';
        if (valveOn[b][0])
        {
            line[4] = 'V';
            line[5] = '1';
        }
        if (valveOn[b][1])
        {
            line[8] = 'V';
            line[9] = '2';
        }
        if (valveOn[b][2])
        {
            line[12] = 'V';
            line[13] = '3';
        }
        if (b == 0 && pumpOn)
        {
            line[16] = 'P';
            line[17] = 'm';
        }
        line[LCD_COLS] = '\0';
        lcd.setCursor(0, b);
        lcd.print(line);
    }
}

// Idle view — date & time from DS3231
void lcdShowIdle()
{
    if (lcdDirty)
    {
        lcdLine(0, "  Irrigation Ctrl   ");
        lcdLine(1, "");
    }

    if (!rtcOk)
    {
        lcdLine(2, "  RTC not found!    ");
        lcdLine(3, "");
        return;
    }

    static const char *DAYS[] = {"Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
    DateTime now = rtc.now();
    char buf[LCD_COLS + 1];

    // Date only changes once per day — skip the I2C write when unchanged
    static uint8_t lastDay = 255;
    if (lcdDirty || now.day() != lastDay)
    {
        lastDay = now.day();
        snprintf(buf, sizeof(buf), "  %s %02d.%02d.%04d   ",
                 DAYS[now.dayOfTheWeek()],
                 now.day(), now.month(), now.year());
        lcdLine(2, buf);
    }

    snprintf(buf, sizeof(buf), "      %02d:%02d:%02d      ",
             now.hour(), now.minute(), now.second());
    lcdLine(3, buf);
}

void updateLCD()
{
    if (!lcdOk) return;
    // Periodic full reinit restores the HD44780 controller after noise-corrupted state
    static unsigned long lastReinit = 0;
    if (millis() - lastReinit >= LCD_REINIT_INTERVAL_MS)
    {
        lastReinit = millis();
        lcd.init();
        lcd.backlight();
        lcdDirty = true;
    }

    if (anyActive())
    {
        static unsigned long lastForce = 0;
        if (lcdDirty || millis() - lastForce >= 30000)
        {
            lcdShowActive();
            lastForce = millis();
        }
    }
    else
    {
        lcdShowIdle();
    }
    lcdDirty = false;

    if (pcfErrActive())
        lcdLine(3, pcfErrMsg);
}

// =============================================================
// MQTT
// =============================================================

void publishState(int box, int valve, bool on)
{
    char topic[64];
    if (valve < 0)
        snprintf(topic, sizeof(topic), "irrigation/pump/state");
    else
        snprintf(topic, sizeof(topic), "irrigation/box/%d/valve/%d/state", box, valve);
    if (!mqtt.publish(topic, on ? "ON" : "OFF", true))
    { // retained
        snprintf(pcfErrMsg, sizeof(pcfErrMsg), "MQTT publish failed!");
        pcfErrFor(5000);
    }
}

// Publish the state we actually believe each output is in — not a blanket OFF.
// A relay whose write failed stays reported as open until the retry confirms it.
void publishAllState()
{
    for (int b = 1; b <= NUM_BOXES; b++)
        for (int v = 1; v <= VALVES_PER_BOX; v++)
            publishState(b, v, valveOn[b - 1][v - 1]);
    publishState(0, -1, pumpOn);
}

// A successful flush means the shadow register is what the hardware is doing:
// bring the reported state in line with it and publish whatever moved. This is
// also how a write that failed earlier gets reported once the bus recovers.
void syncValvesFromShadow(int idx)
{
    bool connected = mqtt.connected();
    for (int i = 0; i < 2; i++)
    {
        int box = idx * 2 + 1 + i;
        for (int v = 1; v <= VALVES_PER_BOX; v++)
        {
            bool want = relayBitOn(idx, i * 3 + (v - 1));
            if (valveOn[box - 1][v - 1] == want)
                continue;
            valveOn[box - 1][v - 1] = want;
            if (want)
                valveOnAt[box - 1][v - 1] = millis();
            if (connected)
                publishState(box, v, want);
            lcdDirty = true;
        }
    }
}

// box 1-4, valve 1-3 — the one place a valve transition is applied: keeps the
// safety-cap stamp, the relay, the LCD mirror and the published state in step.
void setValve(int box, int valve, bool on)
{
    if (on && valveLatched[box - 1][valve - 1])
    {
        // Re-publish OFF so the Pi's view stays truthful about the refusal.
        publishState(box, valve, false);
        snprintf(pcfErrMsg, sizeof(pcfErrMsg), "B%d V%d latched off", box, valve);
        pcfErrFor(5000);
        log_w("Valve B%d:V%d ON ignored - latched by safety timer until OFF", box, valve);
        return;
    }
    if (!on)
        valveLatched[box - 1][valve - 1] = false;

    int idx = (box <= 2) ? 0 : 1;
    if (setRelay(box, valve, on))
    {
        // syncValvesFromShadow stamps the OFF->ON edge and publishes, so a
        // repeated ON (the Pi's keepalive) cannot push out the open-time cap.
        syncValvesFromShadow(idx);
        if (on)
            lastValveActivityAt = millis();
    }
    else
    {
        // The write never reached the expander, so the relay did not move.
        // Leave the reported state alone rather than publishing a change we did
        // not achieve — a valve reported closed while still energised is exactly
        // the failure this guards against. loop() retries until the bus is back.
        log_e("Valve B%d:V%d write failed - state unchanged, retrying", box, valve);
    }
    lcdDirty = true;
}

void setPump(bool on)
{
#if RELAY_ACTIVE_LOW
    digitalWrite(PUMP_PIN, on ? LOW : HIGH);
#else
    digitalWrite(PUMP_PIN, on ? HIGH : LOW);
#endif
    pumpOn = on;
    if (on)
        lastValveActivityAt = millis();
    publishState(0, -1, on);
    lcdDirty = true;
}

void mqttCallback(char *topic, byte *payload, unsigned int len)
{
    bool on = (len == 2 && payload[0] == 'O' && payload[1] == 'N');
    int box, valve;

    if (sscanf(topic, "irrigation/box/%d/valve/%d/set", &box, &valve) == 2 && box >= 1 && box <= NUM_BOXES && valve >= 1 && valve <= VALVES_PER_BOX)
    {
        setValve(box, valve, on);
    }
    else if (strcmp(topic, "irrigation/pump/set") == 0)
    {
        setPump(on);
    }
    else if (strcmp(topic, "irrigation/cmd/stop_all") == 0)
    {
        allOff();
        publishAllState();
    }
    else if (strcmp(topic, "irrigation/cmd/ota_update") == 0)
    {
        log_i("OTA check triggered");
        lcdLine(0, "  OTA: checking...  ");
        lcdLine(1, "");
        lcdLine(2, "");
        lcdLine(3, "");
        if (fota.execHTTPcheck())
        {
            log_i("OTA update found, flashing...");
            allOff();
            publishAllState();
            lcdLine(0, "  OTA: updating...  ");
            lcdLine(1, "  Do not power off  ");
            lcdLine(2, "");
            lcdLine(3, "");
            fota.execOTA(); // reboots on success; falls through only on failure

