dejmekz/irrigation-system/ESP32/src/main.cpp
            // Reached only on failure. Capture the real reason before restarting.
            if (otaMagic != OTA_RTC_MAGIC)
            {
                otaMagic = OTA_RTC_MAGIC;
                otaFailCount = 0;
            }
            otaLastError = (int)Update.getError();
            otaFailCount++;
            log_e("OTA update failed, Update error #%d (failure %d)",
                  otaLastError, otaFailCount);

            char errline[LCD_COLS + 1];
            snprintf(errline, sizeof(errline), " OTA fail err=%d", otaLastError);
            lcdLine(0, "  OTA: failed!      ");
            lcdLine(2, errline);
            lcdLine(1, "  Restarting...     ");
            delay(3000);
            ESP.restart();
        }
        else
        {
            log_i("OTA: already up to date");
            lcdLine(1, "  Already latest    ");
            delay(2000);
            lcdDirty = true;
        }
    }
}

void publishHwStatus()
{
    if (!mqtt.connected())
        return;
    char payload[96];
    snprintf(payload, sizeof(payload),
             "{\"pcf0\":%s,\"pcf1\":%s,\"rtc\":%s,\"lcd\":%s}",
             pcfOk[0] ? "true" : "false",
             pcfOk[1] ? "true" : "false",
             rtcOk    ? "true" : "false",
             lcdOk    ? "true" : "false");
    mqtt.publish("irrigation/hw_status", payload, true);
}

void publishHeartbeat()
{
    if (!mqtt.connected())
        return;

    char active[80] = "";
    int pos = 0;

    for (int b = 0; b < NUM_BOXES; b++)
        for (int v = 0; v < VALVES_PER_BOX; v++)
            if (valveOn[b][v])
            {
                int n = snprintf(active + pos, sizeof(active) - pos, "B%d:V%d ", b + 1, v + 1);
                if (n > 0 && pos + n < (int)sizeof(active))
                    pos += n;
            }

    if (pumpOn)
        snprintf(active + pos, (int)sizeof(active) - pos > 0 ? sizeof(active) - pos : 0, "pump");

    bool hwOk = pcfOk[0] && pcfOk[1] && rtcOk;

    // Which app partition we booted from and which one an OTA would write to,
    // with their real sizes. The build only ever knew what the partition CSV
    // claimed, which turned out not to match the table actually burned on the
    // chip — a mismatch that shows up as an OTA that looks like a network fault.
    // Reporting it here means the ceiling is a number you can read, not one you
    // have to discover by bisecting failed flashes.
    const esp_partition_t *running = esp_ota_get_running_partition();
    const esp_partition_t *next = esp_ota_get_next_update_partition(NULL);
    char part[128] = "";
    snprintf(part, sizeof(part),
             ",\"part\":{\"run\":\"%s\",\"run_sz\":%u,\"next\":\"%s\",\"next_sz\":%u}",
             running ? running->label : "?",
             running ? (unsigned)running->size : 0,
             next ? next->label : "?",
             next ? (unsigned)next->size : 0);

    // Carry the last OTA failure out with the heartbeat: the Pi logs heartbeats
    // verbatim, so the reason survives the reboot and needs no extra plumbing.
    // Why the chip last reset. If an OTA failure path ran, this is 3 (SW) and
    // ota_err says what went wrong. If it is 9 (BROWNOUT) or 4 (PANIC) instead,
    // the device died mid-flash and never reached that code — which would
    // explain both the random truncation points and the missing error code, and
    // would make this a power problem rather than a network or library one.
    int rst = (int)esp_reset_reason();

    char otaInfo[64] = "";
    if (otaMagic == OTA_RTC_MAGIC && otaFailCount > 0)
        snprintf(otaInfo, sizeof(otaInfo), ",\"rst\":%d,\"ota_err\":%d,\"ota_fails\":%d",
                 rst, otaLastError, otaFailCount);
    else
        snprintf(otaInfo, sizeof(otaInfo), ",\"rst\":%d", rst);

    char payload[288];
    if (active[0] == '\0')
        snprintf(payload, sizeof(payload), "{\"status\":\"idle\",\"fw\":%d,\"hw_ok\":%s%s%s}",
                 FIRMWARE_VERSION, hwOk ? "true" : "false", part, otaInfo);
    else
        snprintf(payload, sizeof(payload), "{\"status\":\"active\",\"active\":\"%s\",\"fw\":%d,\"hw_ok\":%s%s%s}",
                 active, FIRMWARE_VERSION, hwOk ? "true" : "false", part, otaInfo);

    mqtt.publish(MQTT_HEARTBEAT_TOPIC, payload, true);
}

bool mqttReconnect()
{
    if (!mqtt.connect(MQTT_CLIENT_ID, MQTT_USER, MQTT_PASSWORD,
                      MQTT_STATUS_TOPIC, 0, true, "offline"))
    {
        log_e("MQTT connect failed");
        return false;
    }
    log_i("MQTT connected");
    mqtt.publish(MQTT_STATUS_TOPIC, "online", true);
    // QoS 1: the broker delivers at min(publish QoS, subscription QoS), so
    // subscribing at 0 would silently downgrade the Pi's QoS 1 commands back to
    // fire-and-forget. PubSubClient always connects with cleanSession=true, so
    // nothing is queued for us while we are offline — stale valve commands are
    // never replayed after a reboot, which is what we want.
    mqtt.subscribe("irrigation/box/+/valve/+/set", 1);
    mqtt.subscribe("irrigation/pump/set", 1);
    mqtt.subscribe("irrigation/cmd/+", 1);
    publishAllState();
    publishHeartbeat();
    publishHwStatus();
    hwStatusDirty = false;
    return true;
}

// =============================================================
// WiFi
// =============================================================

void wifiConnect()
{
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    lcdLine(0, "  Irrigation Ctrl   ");
    lcdLine(1, "  WiFi connecting...");
    lcdLine(2, "");
    lcdLine(3, "");
}

// =============================================================
// Setup & Loop
// =============================================================

void setup()
{
    Serial.begin(115200);
    Serial.println(FW_VERSION_TAG);   // also keeps the marker in the image

    Wire.begin(I2C_SDA, I2C_SCL);
    Wire.setClock(I2C_CLOCK_HZ);
    fota.setManifestURL(OTA_MANIFEST_URL);

    // LCD — probe before init; LiquidCrystal_I2C has no return value from init()
    Wire.beginTransmission(LCD_ADDR);
    lcdOk = (Wire.endTransmission() == 0);
    if (!lcdOk)
        log_e("LCD not found at 0x%02X", LCD_ADDR);
    lcd.init();
    lcd.backlight();
    lcdLine(0, "  Irrigation Ctrl   ");
    lcdLine(1, "  Starting...       ");
    lcdLine(2, "");
    lcdLine(3, "");

    // RTC
    rtcOk = rtc.begin();
    if (!rtcOk)
    {
        log_e("RTC not found");
        if (lcdOk) { lcdLine(2, "  RTC not found!    "); delay(2000); }
    }
    else
    {
        log_i("RTC ok");
    }

    // PCF8574A — write initial state (all relays OFF) and verify presence
    for (int i = 0; i < 2; i++)
    {
        Wire.beginTransmission(PCF_ADDR[i]);
        Wire.write(pcfState[i]);
        pcfOk[i] = (Wire.endTransmission() == 0);
        if (!pcfOk[i])
        {
            log_e("PCF[%d] not found", i);
            if (lcdOk)
            {
                char msg[LCD_COLS + 1];
                snprintf(msg, sizeof(msg), "  PCF[%d] not found! ", i);
                lcdLine(2, msg);
                delay(2000);
            }
        }
        else
        {
            log_i("PCF[%d] ok", i);
        }
    }

    // Pump GPIO — start OFF
    pinMode(PUMP_PIN, OUTPUT);
#if RELAY_ACTIVE_LOW
    digitalWrite(PUMP_PIN, HIGH);
#else
    digitalWrite(PUMP_PIN, LOW);
#endif

    // WiFi — auto-reconnect handles transient drops; wifiConnect() for initial join
    WiFi.setAutoReconnect(true);
    wifiConnect();

    // MQTT
    mqtt.setServer(MQTT_HOST, MQTT_PORT);
    mqtt.setCallback(mqttCallback);
    lcdLine(1, "  MQTT connecting...");
    mqttReconnect();
    lcdLine(1, "  Ready             ");
    delay(800);

    // Hardware task watchdog — reboots ESP32 if loop() ever stalls
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    {
        esp_task_wdt_config_t c = {.timeout_ms = TASK_WDT_TIMEOUT_S * 1000, .idle_core_mask = 0, .trigger_panic = false};
        esp_task_wdt_reconfigure(&c);
    }
#else
    esp_task_wdt_init(TASK_WDT_TIMEOUT_S, false);
#endif
    esp_task_wdt_add(NULL);
}

void loop()
{
    esp_task_wdt_reset();

    // --- 1. CONTROL OF WI-FI STATE AND SAFETY RESTART ---
    // Fix #12: arm the watchdog timer the moment WiFi drops; only reset it after
    // the connection has been stable for >=5 s to survive brief reconnect flickers.
    static unsigned long wifiLostAt = 0;
    static unsigned long wifiStableAt = 0;
    static bool wifiWasConnected = false;

